Revit 2024 API
BuiltInFailures.CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked Property
 Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TypePanelsFronNonRectCellsUnlocked { get; }
Visual Basic
Public Shared ReadOnly Property TypePanelsFronNonRectCellsUnlocked As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TypePanelsFronNonRectCellsUnlocked {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace